; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-3nodes-1000size-5degree-100mindistance-5trucks-3packages-497seed

(define (problem transport-three-cities-sequential-3nodes-1000size-5degree-100mindistance-5trucks-3packages-497seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  truck-5 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 980,745 -> 268,612
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 73)
  ; 268,612 -> 980,745
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 73)
  ; 853,161 -> 268,612
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 74)
  ; 268,612 -> 853,161
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 74)
  ; 853,161 -> 980,745
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 60)
  ; 980,745 -> 853,161
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 60)
  ; 2663,106 -> 2342,202
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 34)
  ; 2342,202 -> 2663,106
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 34)
  ; 2095,928 -> 2342,202
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 77)
  ; 2342,202 -> 2095,928
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 77)
  ; 1513,2329 -> 1073,2307
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 45)
  ; 1073,2307 -> 1513,2329
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 45)
  ; 1737,2328 -> 1073,2307
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 67)
  ; 1073,2307 -> 1737,2328
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 67)
  ; 1737,2328 -> 1513,2329
  (road city-3-loc-3 city-3-loc-2)
  (= (road-length city-3-loc-3 city-3-loc-2) 23)
  ; 1513,2329 -> 1737,2328
  (road city-3-loc-2 city-3-loc-3)
  (= (road-length city-3-loc-2 city-3-loc-3) 23)
  ; 980,745 <-> 2095,928
  (road city-1-loc-2 city-2-loc-3)
  (= (road-length city-1-loc-2 city-2-loc-3) 113)
  (road city-2-loc-3 city-1-loc-2)
  (= (road-length city-2-loc-3 city-1-loc-2) 113)
  (road city-1-loc-2 city-3-loc-1)
  (= (road-length city-1-loc-2 city-3-loc-1) 147)
  (road city-3-loc-1 city-1-loc-2)
  (= (road-length city-3-loc-1 city-1-loc-2) 147)
  (road city-2-loc-2 city-3-loc-3)
  (= (road-length city-2-loc-2 city-3-loc-3) 113)
  (road city-3-loc-3 city-2-loc-2)
  (= (road-length city-3-loc-3 city-2-loc-2) 113)
  (at package-1 city-1-loc-3)
  (at package-2 city-2-loc-2)
  (at package-3 city-1-loc-1)
  (at truck-1 city-3-loc-1)
  (capacity truck-1 capacity-2)
  (at truck-2 city-1-loc-2)
  (capacity truck-2 capacity-4)
  (at truck-3 city-1-loc-3)
  (capacity truck-3 capacity-4)
  (at truck-4 city-1-loc-2)
  (capacity truck-4 capacity-4)
  (at truck-5 city-1-loc-1)
  (capacity truck-5 capacity-4)
 )
 (:goal (and
  (at package-1 city-3-loc-2)
  (at package-2 city-3-loc-1)
  (at package-3 city-2-loc-1)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-3 city-1-loc-3 package-1 capacity-3 capacity-4)
   deleted: (at package-1 city-1-loc-3) (capacity truck-3 capacity-4)
   added: (in package-1 truck-3) (capacity truck-3 capacity-3)
   goals met: 0 of 3
2. (drive truck-3 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-1-loc-1)
   goals met: 0 of 3
3. (pick-up truck-3 city-1-loc-1 package-3 capacity-2 capacity-3)
   deleted: (at package-3 city-1-loc-1) (capacity truck-3 capacity-3)
   added: (in package-3 truck-3) (capacity truck-3 capacity-2)
   goals met: 0 of 3
4. (drive truck-3 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-3 city-1-loc-1)
   added: (at truck-3 city-1-loc-2)
   goals met: 0 of 3
5. (drive truck-3 city-1-loc-2 city-2-loc-3)
   deleted: (at truck-3 city-1-loc-2)
   added: (at truck-3 city-2-loc-3)
   goals met: 0 of 3
6. (drive truck-3 city-2-loc-3 city-2-loc-1)
   deleted: (at truck-3 city-2-loc-3)
   added: (at truck-3 city-2-loc-1)
   goals met: 0 of 3
7. (drop truck-3 city-2-loc-1 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-3) (capacity truck-3 capacity-2)
   added: (at package-3 city-2-loc-1) (capacity truck-3 capacity-3)
   goals met: 1 of 3
8. (drive truck-3 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-3 city-2-loc-1)
   added: (at truck-3 city-2-loc-2)
   goals met: 1 of 3
9. (pick-up truck-3 city-2-loc-2 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-2-loc-2) (capacity truck-3 capacity-3)
   added: (in package-2 truck-3) (capacity truck-3 capacity-2)
   goals met: 1 of 3
10. (drive truck-3 city-2-loc-2 city-3-loc-3)
   deleted: (at truck-3 city-2-loc-2)
   added: (at truck-3 city-3-loc-3)
   goals met: 1 of 3
11. (drive truck-3 city-3-loc-3 city-3-loc-1)
   deleted: (at truck-3 city-3-loc-3)
   added: (at truck-3 city-3-loc-1)
   goals met: 1 of 3
12. (drop truck-3 city-3-loc-1 package-2 capacity-2 capacity-3)
   deleted: (in package-2 truck-3) (capacity truck-3 capacity-2)
   added: (at package-2 city-3-loc-1) (capacity truck-3 capacity-3)
   goals met: 2 of 3
13. (drive truck-3 city-3-loc-1 city-3-loc-2)
   deleted: (at truck-3 city-3-loc-1)
   added: (at truck-3 city-3-loc-2)
   goals met: 2 of 3
14. (drop truck-3 city-3-loc-2 package-1 capacity-3 capacity-4)
   deleted: (in package-1 truck-3) (capacity truck-3 capacity-3)
   added: (at package-1 city-3-loc-2) (capacity truck-3 capacity-4)
   goals met: 3 of 3
